/* --створити масив з:
  - з 5 числових значень
- з 5 стічкових значень
- з 5 значень стрічкового, числового та булевого типу
- та вивести його в консоль*/

/*let a = [
  5, 6, 7, 49, 20894
];
let b = [
  'полуниця', 'малинa', 'гранат', 'яблуко', 'груша'
];
let  c = [
  8935, 'малинa', 9 === 9, 123, 9 < 3
]

console.log(a);
console.log(b);
console.log(c);*/

// Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

/*let arr = [];
arr[0] = 'js'
arr[1] = 2021
arr[2] = 'welcome'
console.log(arr);*/

// За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
/*for (let i = 0; i < 10; i++) {
  document.write(`<div>hallo</div>`)
}*/


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
/*for (let i = 0; i < 10; i++) {
 document.write(`<div>{i} Lorem ipsum dolor sit amet.</div>`)

}*/

/*// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
/!*let i = '';
while (i < 20) {
  document.write(`<h1>Lorem ipsum dolor sit.</h1>`)
  i++
}*!/*/


/*// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
let q = '';
while (q <20){
  document.write(`<h1>{q} Lorem ipsum dolor sit. </h1>`)
  q++
}*/



/*// Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

let arr = [10,203,13,123,546,35,235,5235,456,234,23];
for (let i = 0; i < arr.length; i++) {
  console.log(arr[i]);
  }*/

/*// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

let fruit = ['Гранат', 'Авокадо', 'Ківі', 'Лічі', 'Хурма', 'Виноград', 'Малина', 'Яблуко', 'Груша', 'Ківі'];
for (let i = 0; i < fruit.length; i++) {
  console.log(fruit[i]);
}*/

/*
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

let newArr = [123, 933, 5 > 4, 'Виноград', 'Малина', 'Авокадо',10 === 10, 'Ківі', 'Авокадо', 34];
for (let i = 0; i < newArr.length; i++) {
  console.log(newArr[i])
}*/

/*// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
let arr = ['The Beatles', 1960, 'Aerosmith', 1970, 'The Rolling Stones', 1962, 'АС/DC', 1973, 'Nirvana', 1987];
for (let arrElement of arr) {
  if (typeof arrElement === 'boolean') {
    console.log(arrElement)
  }
}*/




/*// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи


let arr = ['The Beatles', 1960, 'Aerosmith', 1970, 'The Rolling Stones', 1962, 'АС/DC', 1973, 'Nirvana', 1987];
for (const arrElement of arr) {
  if (typeof arrElement === 'string'){
    console.log(arrElement)
  }

}*/


